# Advanced Dataframes

## Part 1

Use your function to obtain a connection to the employees database.

In [1]:
import pandas as pd
import numpy as np
from pydataset import data
import env # contains database access

Read the employees and titles tables into two separate DataFrames.

In [2]:
query = """
SELECT *
FROM employees;
"""

emp_data = pd.read_sql(query, env.get_db_access("employees"))
emp_data.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

Tittles dataframe

In [3]:
query = """
SELECT *
FROM titles;
"""

titles_data = pd.read_sql(query, env.get_db_access('employees'))
titles_data.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

How many rows and columns do you have in each DataFrame? Is that what you expected?

In [4]:
emp_data.shape

(300024, 6)

In [5]:
titles_data.shape

(443308, 4)

Display the summary statistics for each DataFrame.

In [6]:
emp_data.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [7]:
titles_data.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

How many unique titles are in the titles DataFrame?

In [8]:
titles_data.nunique()

emp_no       300024
title             7
from_date      6393
to_date        5888
dtype: int64

In [9]:
titles_data.title.nunique()

7

What is the oldest date in the to_date column?

In [10]:
titles_data.to_date.min()

datetime.date(1985, 3, 1)

What is the most recent date in the to_date column?

In [11]:
titles_data.to_date.max()

datetime.date(9999, 1, 1)

## Part 2

1. Copy the users and roles DataFrames from the examples above.

In [12]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [13]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

2. What is the result of using a right join on the DataFrames?

In [14]:
def merge_right(users, roles):
    return users.merge(roles, how= "right", on= "id")

merge_right(users, roles)

   id name_x  role_id     name_y
0   1    bob      1.0      admin
1   2    joe      2.0     author
2   3  sally      3.0   reviewer
3   4   adam      3.0  commenter

3. What is the result of using an outer join on the DataFrames?

In [15]:
def merge_outer(users, roles):
    return users.merge(roles, how= "outer", on= "id")

merge_outer(users, roles)

   id name_x  role_id     name_y
0   1    bob      1.0      admin
1   2    joe      2.0     author
2   3  sally      3.0   reviewer
3   4   adam      3.0  commenter
4   5   jane      NaN        NaN
5   6   mike      NaN        NaN

4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [16]:
def drop_fKey(df):
    return df.drop(["id"], axis= 1)

new_users = drop_fKey(users)
new_roles = drop_fKey(roles)

In [17]:
new_users.merge(new_roles, how= "right", on= "name")

        name  role_id
0      admin      NaN
1     author      NaN
2   reviewer      NaN
3  commenter      NaN

In [18]:
new_users.merge(new_roles, how= "outer", on= "name")

        name  role_id
0        bob      1.0
1        joe      2.0
2      sally      3.0
3       adam      3.0
4       jane      NaN
5       mike      NaN
6      admin      NaN
7     author      NaN
8   reviewer      NaN
9  commenter      NaN

5. Load the mpg dataset from PyDataset.

In [19]:
mpg = data("mpg")

6. Output and read the documentation for the mpg dataset.

In [20]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

7. How many rows and columns are in the dataset?

In [21]:
mpg.shape

(234, 11)

8. Check out your column names and perform any cleanup you may want on them.

In [22]:
mpg.columns
mpg = mpg.rename(columns = {"displ":"display",
            "cyl":"cylenders",
            "trans":"transmission",
            "drv":"drivers",
            "cty":"city",
            "hwy":"highway",
            "fl":"fuel",
           })
mpg.head()

,manufacturer,model,display,year,cylenders,transmission,drivers,city,highway,fuel,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

9. Display the summary statistics for the dataset.

In [23]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   display       234 non-null    float64
 3   year          234 non-null    int64
 4   cylenders     234 non-null    int64
 5   transmission  234 non-null    object
 6   drivers       234 non-null    object
 7   city          234 non-null    int64
 8   highway       234 non-null    int64
 9   fuel          234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [24]:
mpg.describe

<bound method NDFrame.describe of     manufacturer   model  display  year  cylenders transmission drivers  city  \
1           audi      a4      1.8  1999          4     auto(l5)       f    18
2           audi      a4      1.8  1999          4   manual(m5)       f    21
3           audi      a4      2.0  2008          4   manual(m6)       f    20
4           audi      a4      2.0  2008          4     auto(av)       f    21
5           audi      a4      2.8  1999          6     auto(l5)       f    16
..           ...     ...      ...   ...        ...          ...     ...   ...
230   volkswagen  passat      2.0  2008          4     auto(s6)       f    19
231   volkswagen  passat      2.0  2008          4   manual(m6)       f    21
232   volkswagen  passat      2.8  1999          6     auto(l5)       f    16
233   volkswagen  passat      2.8  1999          6   manual(m5)       f    18
234   volkswagen  passat      3.6  2008          6     auto(s6)       f    17

     highway fuel    class
1         29    p  compact
2         29    p  compact
3         31    p  compact
4         30    p  compact
5         26    p  compact
..       ...  ...      ...
230       28    p  midsize
231       29    p  midsize
232       26    p  midsize
233       26    p  midsize
234       26    p  midsize

[234 rows x 11 columns]>

10. How many different manufacturers are there?

In [25]:
mpg.manufacturer.nunique()

15

11. How many different models are there?

In [26]:
mpg.model.nunique()

38

12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [29]:
mpg["mileage_difference"] = abs(mpg.highway - mpg.city)
mpg.head(1)

,manufacturer,model,display,year,cylenders,transmission,drivers,city,highway,fuel,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11

13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [33]:
mpg["average_mileage"] = mpg[["city", "highway"]].agg("mean", axis= 1)
mpg.head(1)

,manufacturer,model,display,year,cylenders,transmission,drivers,city,highway,fuel,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5

14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [60]:
mpg["is_automatic"] = mpg.transmission.str.contains("auto")
mpg.head(1)

,manufacturer,model,display,year,cylenders,transmission,drivers,city,highway,fuel,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True

15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [56]:
mpg.groupby(mpg.manufacturer).average_mileage.mean().sort_values(ascending=False).head(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

16. Do automatic or manual cars have better miles per gallon?

In [62]:
mpg.groupby(mpg.transmission).average_mileage.mean().sort_values()

transmission
auto(l6)      16.833333
auto(l5)      17.717949
auto(l4)      18.951807
manual(m6)    20.552632
auto(s6)      21.281250
auto(s5)      21.333333
auto(s4)      22.166667
manual(m5)    22.775862
auto(av)      23.900000
auto(l3)      24.000000
Name: average_mileage, dtype: float64

## Part 3

1. Use your get_db_url function to help you explore the data from the chipotle database.

In [67]:
query = """
SELECT *
FROM orders;
"""

chipotle = pd.read_sql(query, env.get_db_access("chipotle"))
chipotle.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

2. What is the total price for each order?

In [76]:
chipotle["price"] = chipotle.item_price.str.replace("[$]", "", regex=True).astype(float)
chipotle.head(1)

,id,order_id,quantity,item_name,choice_description,item_price,price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39,2.39

In [77]:
chipotle.groupby(chipotle.order_id).price.agg("sum")

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: price, Length: 1834, dtype: float64

3. What are the most popular 3 items?

In [83]:
chipotle.item_name.value_counts().head(1)

Chicken Bowl    726
Name: item_name, dtype: int64

4. Which item has produced the most revenue?

In [89]:
chipotle.groupby(chipotle.item_name).price.agg("sum").sort_values(ascending=False).head(1)

item_name
Chicken Bowl    7342.73
Name: price, dtype: float64

5. Join the employees and titles DataFrames together.

In [91]:
emp_and_title = emp_data.merge(titles_data, how= "inner", on="emp_no")
emp_and_title.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

6. For each title, find the hire date of the employee that was hired most recently with that title.

In [98]:
emp_and_title.groupby(emp_and_title.title).hire_date.agg("max")

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [103]:
query = """
SELECT *
FROM departments;
"""

departments = pd.read_sql(query, env.get_db_access("employees"))
departments.head()

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

In [105]:
cross_tab = pd.crosstab(departments["dept_name"],titles_data["title"])
cross_tab

title               Engineer  Senior Engineer  Senior Staff  Staff
dept_name
Customer Service           0                1             0      0
Development                0                0             0      1
Finance                    0                1             0      0
Human Resources            1                0             0      0
Marketing                  0                1             0      0
Production                 0                0             1      0
Quality Management         0                0             0      1
Research                   0                1             0      0
Sales                      0                0             1      0